Repository: BravoBaldo/Translations
Catalog: WaveShare/OmegaT_WaveShare/OmegaT_WaveShare-level1.tmx
Source language: en_us
Languages: it_it

source: CAN interface
it_it: Interfaccia CAN

source: CAN interface chip
it_it: Chip di interfaccia CAN

source: CAN interface: Implements the transmission and reception control, data analysis, acquisition and monitoring of the CAN bus network
it_it: CAN interface: Implementa il controllo di trasmissione e ricezione, l'analisi dei dati, l'acquisizione e il monitoraggio della rete bus CAN.

source: CAN terminal resistor selection interface
it_it: Interfaccia di selezione della resistenza terminale CAN

source: CAN-USB/2 CAN-USB/Micro other CAN-USB interfaces
it_it: CAN-USB/2 CAN-USB/Micro altre interfacce CAN-USB

source: CANopen Connection
it_it: Connessione CANopen

source: CH343 Datasheet
it_it: Datasheet di ST7262

source: CH347 Applicationa Development Manual
it_it: Manuale di Sviluppo Applicazioni CH347

source: CH347T_Config.py corresponds to the reference example "../OLED_Module_Code/RaspberryPi/python/lib/waveshare_OLED/config.py", define CH347T device initialization, etc.
it_it: CH347T_Config.py corrisponde all'esempio di riferimento "../OLED_Module_Code/RaspberryPi/python/lib/waveshare_OLED/config.py", definisce l'inizializzazione del dispositivo CH347T, ecc.

source: CH422G Datasheet
it_it: Datasheet di ST7262

source: CHG: Lithium battery charging indicator
it_it: CHG: Indicatore di carica della batteria al litio

source: COB-ID: this is the COB-ID of the selected RPDO.
it_it: COB-ID: questo è il COB-ID dell'RPDO selezionato.

source: COB-ID: this is the COB-ID of the selected TPDO.
it_it: COB-ID: questo è il COB-ID del TPDO selezionato.

source: CONFIG_ESPTOOLPY_FLASHFREQ_120M=y [Need to be consistent with PSRAM]
it_it: CONFIG_ESPTOOLPY_FLASHFREQ_120M=y [Deve essere coerente con PSRAM]

source: CONFIG_IDF_EXPERIMENTAL_FEATURES=y and CONFIG_SPIRAM_SPEED_120M=y [Need to be consistent with FLASH]
it_it: CONFIG_IDF_EXPERIMENTAL_FEATURES=y e CONFIG_SPIRAM_SPEED_120M=y [Deve essere coerente con FLASH]

source: Call Wizards with .
it_it: Chiamare le Wizards con .

source: Capacitive
it_it: Capacitivo

source: Change order: Shows a dialog that allows changing the order of the parameters displayed in the graph.
it_it: Change order: Visualizza una finestra di dialogo che consente di modificare l'ordine dei parametri visualizzati nel grafico.

source: Change this if you have set up your module to use a different baud rate.
it_it: Modificare questo valore se il modulo è configurato per utilizzare una velocità in baud diversa.

source: Change this if you have set up your module to use a different bit rate.
it_it: Modificare questa impostazione se il modulo è configurato per utilizzare una velocità in bit diversa.

source: Chapter 8 explains the syntax of the TMCL programming language.
it_it: Il capitolo 8 spiega la sintassi del linguaggio di programmazione TMCL.

source: Check parameter ranges: All parameters used in TMCL commands will be checked against the parameter range entries in the module database of the TMCL-IDE.
it_it: Check parameter ranges: Tutti i parametri utilizzati nei comandi TMCL verranno confrontati con le voci degli intervalli parametri nel database dei moduli di TMCL-IDE.

source: Check the Cyclic checkbox to switch on automatic update.
it_it: Selezionare la checkbox Cyclic per attivare l'aggiornamento automatico.

source: Check the Enabled check box to activate this feature.
it_it: Selezionare il check box Enabled per attivare questa funzione.

source: Check the Enabled checkbox to activate this feature.
it_it: Selezionare il check box Enabled per attivare questa funzione.

source: Check the Enabled checkbox to activate this threshold speed.
it_it: Selezionare il checkbox Enabled per attivare questa soglia di velocità.

source: Check the checkbox of a register in the list to put it into the list of registers that are shown in the list of active registers.
it_it: Spuntare la casella di controllo di un registro nell'elenco per inserirlo nell'elenco dei registri visualizzati nell'elenco dei registri attivi.

source: Chinese system: File Explorer -> View -> Display -> Check "Hidden Items"
it_it: Sistema cinese: File Explorer -> View -> Display -> Check "Hidden Items"

source: Choose a command from the instruction selection menu.
it_it: Scegliere un comando dal menù di selezione delle istruzioni.

source: Choose the Run/Continue function from the Debug menu (or click the Run icon or press F9) to start the program or continue its execution.
it_it: Selezionare la funzione Run/Continue dal menù Debug (o cliccando sull'icona Run o premendo F9) per avviare il programma o continuarne l'esecuzione.

source: Choose the new bitrate from the submenu.
it_it: Scegliere il nuovo bitrate dal sottomenù.

source: Choose the openocd path, it doesn't affect us here, so let's just choose one
it_it: Si sceglie il percorso openocd, non ci riguarda qui, quindi scegliamone uno.

source: Choosing the Options function displays the Assembler/Debugger options dialog.
it_it: Selezionando la funzione Options viene visualizzata la finestra di dialogo delle opzioni Assembler/Debugger.

source: Chopper blank time: Selects the comparator blank time.
it_it: Chopper blank time: Seleziona il tempo di azzeramento del comparatore.

source: Chopper hysteresis end / fast decay time: For SpreadCycle chopper mode this parameter sets the hysteresis end setting.
it_it: Chopper hysteresis end / fast decay time: Per la modalità chopper SpreadCycle, questo parametro imposta il tempo di fine isteresi.

source: Chopper off time: Controls the minimum chopper frequency.
it_it: Chopper off time: Controlla la frequenza minima del chopper.

source: CiA-402 Homing Mode
it_it: Modalità CiA-402 Homing

source: CiA-402 Profile Position Mode
it_it: Modalità di Posizione del Profilo CiA-402

source: CiA-402 Profile Velocity Mode
it_it: La modalità CiA-402 Profile Velocity

source: CiA-402 State Machine
it_it: Macchina a Stati CiA-402

source: Clear list: Clears the entire LSS device list.
it_it: Clear list: Cancella l'intero elenco dei dispositivi LSS.

source: Clear: Clears the entire graph.
it_it: Clear: Cancella l'intero grafico.

source: Clear: This button clears the data buffer of the graph.
it_it: Clear: Questo pulsante cancella il buffer dati del grafico.

source: Click "Run" -> "Run Module" or click F5 to run the demo.
it_it: Cliccare "Run" -> "Run Module" o premere direttamente F5 per eseguire la demo.

source: Click "Run" -> "Run Module" or directly click F5 to run the demo.
it_it: Cliccare su "Run" -> "Run Module" o premere direttamente F5 per eseguire la demo.

source: Click "Run" -> "Run Module" or directly click F5 to run the demos.
it_it: Cliccare "Run" -> "Run Module" o premere direttamente su F5 per eseguire le demo.

source: Click "WIN + R", type cmd, enter pip install pyserial in the window and make sure the pyserial library is installed.
it_it: Cliccare "WIN + R", digitare "cmd", inserire "pip install pyserial" nella finestra e verificare che la libreria "pyserial" sia installata.

source: Click "Win +R" to enable the new command window.
it_it: Cliccare "Win +R" per abilitare la nuova finestra di comando.

source: Click INSTALL.
it_it: Cliccare su INSTALL.

source: Click Initialize SPI (the software and SPI share the same interface), don't care about those parameters before the initialization button.
it_it: Cliccare su "Initialize SPI" (il software e l'SPI condividono la stessa interfaccia), ignorare questi parametri prima del pulsante di inizializzazione.

source: Click WIN + R, and execute the following PIL installation commands:
it_it: Cliccare su WIN + R ed eseguire i seguenti comandi di installazione PIL:

source: Click here to download: esp32_package_3.0.7_arduino offline package
it_it: Cliccare qui per scaricare: esp32_package_3.0.7_arduino offline package

source: Click on "Open Serial Ports" to receive data as shown below:
it_it: Cliccare su "Open Serial Ports" per ricevere i dati come mostrato di seguito:

source: Click on a group to expand it and to show all registers that belong to that group.
it_it: Cliccare su un gruppo per espanderlo e visualizzare tutti i registri che appartengono a quel gruppo.

source: Click on a module and then click the right arrow button or double click on a module to transfer it to the list of assigned modules.
it_it: Cliccare su un modulo e quindi sul pulsante freccia destra oppure fare doppio clic su un modulo per trasferirlo all'elenco dei moduli assegnati.

source: Click on a pin to change between three possible states:
it_it: Cliccando su un pin si può passare da uno stato all'altro tra tre possibili:

source: Click on a sub index to select it.
it_it: Clickcare su un sottoindice per selezionarlo.

source: Click on a value to modify it.
it_it: Cliccare su un valore per modificarlo.

source: Click on an RPDO to select that one.
it_it: Cliccare su un RPDO per selezionarlo.

source: Click on an object to select it.
it_it: Cliccare su un oggetto per selezionarlo.

source: Click on the Landungsbruecke or Startrampe entry in the tree view to open the main evaluation board tool.
it_it: Cliccare sulla voce Landungsbruecke o Startrampe nella vista ad albero per aprire lo strumento principale della "evaluation board".

source: Click on the CANopen connection to open the CANopen connection window for the desired CAN interface.
it_it: Cliccare sulla connessione CANopen per aprire la finestra di connessione CANopen per l'interfaccia CAN desiderata.

source: Click on the ESP32 offline package in Google Drive, you can choose the required version to download according to the board installation requirements, and the rest of the versions can be downloaded by yourself on demand.
it_it: Cliccare sul pacchetto offline ESP32 in Google Drive, si può scegliere la versione richiesta da scaricare in base ai requisiti di installazione della board, mentre le altre versioni possono essere scaricate autonomamente su richiesta.

source: Click on the all-in-one button we described before to compile, flash and open the serial port monitor
it_it: Cliccare sul pulsante multifunzione descritto in precedenza per compilare, flashare e aprire il monitor della porta seriale.

source: Click on the appropriate COM port (the one your module is connected to) to display the connection window for the specific port.
it_it: Cliccare sulla porta COM appropriata (quella a cui è collegato il modulo) per visualizzare la finestra di connessione per la porta specifica.

source: Click on the appropriate interface in the tree view to open the connection window for this interface.
it_it: Cliccare sull'interfaccia appropriata nella vista ad albero per aprire la finestra di connessione per tale interfaccia.

source: Click on the arrow beneath a TPDO entry to view its contents.
it_it: Cliccare sulla freccia sotto una voce TPDO per visualizzarne il contenuto.

source: Click on the index of a module to change its index, but take care not to assign the same index more than once.
it_it: Cliccare sull'indice di un modulo per modificarne l'indice, ma fare attenzione a non assegnare lo stesso indice più di una volta.

source: Click on the module name itself in the module tree to open the main module tool.
it_it: Cliccare sul nome del modulo nella struttura ad albero per aprire lo strumento del Modulo Principale.

source: Click on the module name itself in the tree view to open the main module tool.
it_it: Cliccare sul nome del modulo nella vista ad albero per aprire lo strumento del modulo principale.

source: Click on the name to expand or to collapse the entry.
it_it: Cliccare sul nome per espandere o comprimere la voce.

source: Click on the value to edit it.
it_it: Cliccare sul valore per modificarlo.

source: Click the Copy to TMCL Creator button to copy all the commands to the TMCL Creator or to the TMCL/PC Host.
it_it: Cliccare sul pulsante Copy to TMCL Creator per copiare tutti i comandi in TMCL Creator o nell'host TMCL/PC.

source: Click the Copy to TMCL Creator button to copy the commands to the TMCL Creator.
it_it: Cliccare sul pulsante Copy to TMCL Creator per copiare i comandi in TMCL Creator.

source: Click the Execute button to send the command to the module.
it_it: Cliccare sul pulsante Execute per inviare il comando al modulo.

source: Click the Generate DCF File button in the Device Configuration tool to generate the DCF file.
it_it: Cliccare sul pulsante Generate DCF File nel tool Device Configuration per generare il file DCF.

source: Click the Load button to load a DCF file.
it_it: Cliccare sul pulsante Load per caricare un file DCF.

source: Click the Move absolute or the Move relative button to start the motion.
it_it: Cliccare sul pulsante Move absolute o Move relative per avviare il movimento.

source: Click the Read button to read it again.
it_it: Cliccare sul pulsante Read per rileggerlo.

source: Click the Start Download button to start the download of the values contained by the DCF file.
it_it: Cliccare sul pulsante Start Download per avviare il download dei valori contenuti nel file DCF.

source: Click the Update button to start the update process.
it_it: Cliccare sul pulsante Update per avviare il processo di aggiornamento.

source: Click the Read status word button to update the current state display.
it_it: Cliccare sul pulsante Read status word per aggiornare la visualizzazione dello stato attuale.

source: Click the Apply to Device button to send all registers contents to the chip.
it_it: Cliccare sul pulsante Apply to Device per inviare tutto il contenuto dei registri al chip.

source: Click the Browse button and select the desired firmware file.
it_it: Cliccare sul pulsante Browse e selezionare il file del firmware desiderato.

source: Click the Copy to TMCL Creator button to copy all these commands to the editor of the TMCL Creator.
it_it: Cliccare sul pulsante Copy to TMCL Creator per copiare tutti questi comandi nell'editor di TMCL Creator.

source: Click the Read button in the Read / Write area of the window to read the data from the object.
it_it: Cliccando sul pulsante Read nell'area Read / Write della finestra per leggere i dati dall'oggetto.

source: Click the Use current speed button to use the actual speed as a threshold speed.
it_it: Cliccare sul pulsante Use current speed per utilizzare la velocità effettiva come soglia di velocità.

source: Click the Win+R key, and input "cmd" to enter the command window.
it_it: Premere il tasto "Win+R" e immettere "cmd" per accedere alla finestra "command".

source: Click the arrow button on the right hand side of the graph window to select scaling options.
it_it: Cliccare sul pulsante freccia sul lato destro della finestra del grafico per selezionare le opzioni di scala.

source: Click the arrow button on the right hand side of the window again to hide these options.
it_it: Cliccare nuovamente sul pulsante freccia sul lato destro della finestra per nascondere queste opzioni.

source: Click the arrow on the right edge of the window to show or hide the ramp parameters.
it_it: Cliccare sulla freccia sul bordo destro della finestra per visualizzare o nascondere i parametri della rampa.

source: Click the arrow to open the object sub indices.
it_it: Cliccare sulla freccia per aprire i sottoindici dell'oggetto.

source: Click the right mouse button over the graph window to display the context menu of the graph display window.
it_it: Cliccare con il tasto destro del mouse sulla finestra del grafico per visualizzare il menù contestuale della finestra di visualizzazione del grafico.

source: Click to visit the Arduino official website, select the corresponding system and system bit to download The version of the Arduino IDE needs to be ≥ 1.8, and the path of installation must not be Chinese, otherwise there will be an error when compiling.
it_it: Cliccare per visitare il sito web ufficiale di Arduino, selezionare il sistema e i bit corrispondenti da scaricare La versione dell'IDE Arduino deve essere ≥ 1.8 e il path di installazione non deve essere in cinese, altrimenti si verificherà un errore durante la compilazione.

source: Clicking the button will copy the contents of the display fields into the input fields.
it_it: Cliccando sul pulsante per copiare il contenuto dei campi di visualizzazione nei campi di input.

source: Clicking on will call the Firmware Update Tool.
it_it: Cliccando su si aprirà il Firmware Update Tool.

source: Clicking on will call the TMCL/PC Host.
it_it: Cliccando su si aprirà il TMCL/PC Host.

source: Clicking on the virtual COM port shown in the tree view will open the connection window for this port.
it_it: Cliccando sulla porta COM virtuale visualizzata nella vista ad albero, si aprirà la finestra di connessione per questa porta.

source: Clicking the Copy to TMCL Creator button will copy all these commands to the TMCL Creator tool.
it_it: Cliccando sul pulsante Copy to TMCL Creator, tutti questi comandi verranno copiati nel tool TMCL Creator.

source: Clicking the Copy button that now appears in the TMCL Instruction Selector area copies a command chosen here to the Manual Instruction Input area.
it_it: Cliccando sul pulsante Copy che ora appare nell'area TMCL Instruction Selector, un comando scelto qui viene copiato nell'area Manual Instruction Input.

source: Clicking the Restore Factory Defaults button will completely reset the module.
it_it: Cliccando sul pulsante Restore Factory Defaults il modulo verrà completamente ripristinato.

source: Clicking the Select button will show a dialog for selecting which axis parameters are to be displayed.
it_it: Cliccando sul pulsante Select verrà visualizzata una finestra di dialogo per selezionare i parametri degli assi da visualizzare.

source: Clicking the Select button will show a dialog for selecting which parameters are to be displayed.
it_it: Cliccando sul pulsante Select verrà visualizzata una finestra di dialogo per selezionare i parametri da visualizzare.

source: Clicking the Select button will show a dialog for selecting which variables are to be displayed.
it_it: Cliccando sul pulsante Select verrà visualizzata una finestra di dialogo per selezionare le variabili da visualizzare.

source: Clicking the Write button will write the data to the object.
it_it: Cliccando sul pulsante Write dati verranno scritti nell'oggetto.

source: Clicking the Remove flags from Toolbar will remove all flags from the toolbar.
it_it: Cliccando su Remove flags from Toolbar tutti i flag verranno rimossi dalla barra degli strumenti.

source: Clicking the Generate DCF File button will start the DCF file generation.
it_it: Cliccando sul pulsante Generate DCF File si avvierà la generazione del file DCF.

source: Clicking the button copies the contents of the display fields into the input fields.
it_it: Cliccando sul pulsante per copiare il contenuto dei campi di visualizzazione nei campi di input.

source: Clicking the Write button writes the contents of the input field to the object.
it_it: Cliccando sul pulsante Write il contenuto del campo di input viene scritto nell'oggetto.

source: Clicking the Execute button in the Manual Instruction Input area sends this command to the module.
it_it: Cliccando sul pulsante Execute nell'area Manual Instruction Input, questo comando viene inviato al modulo.

source: Clicking the right mouse button over a PDO entry brings up a context menu.
it_it: Cliccando col tasto destro del mouse su una voce PDO si apre un menu contestuale.

source: Clicking the right mouse button over the graphical view brings up the PDO graph context menu.
it_it: Cliccando con il tasto destro del mouse sulla vista grafica si apre il menu contestuale del grafico PDO.

source: Clicking the right mouse button over the list of LSS modules brings up a context menu containing functions for individual devices.
it_it: Cliccando col pulsante destro del mouse sull'elenco dei moduli LSS, viene visualizzato un menù contestuale contenente le funzioni per i singoli dispositivi.

source: Clock period: When clocked X axis is turned on the clock period can be entered here.
it_it: Clock period: Quando l'asse X sincronizzato è attivato, è possibile inserire qui il periodo di clock.

source: Clock signal
it_it: Segnale di clock

source: Clocked X axis: Selects if the X axis shall be continued using an internal timer (turned off by default).
it_it: Clocked X axis: Seleziona se l'asse X deve essere continuato utilizzando un timer interno (disattivato per default).

source: Close all arduino windows to make sure Arduino is turned off
it_it: Chiudere tutte le finestre di Arduino per assicurarsi che Arduino sia spento

source: Close: closes the currently open editor tab (same function as the close button of the editor tab).
it_it: Close: chiude la scheda dell'editor attualmente aperta (stessa funzione del pulsante di chiusura della scheda dell'editor).

source: Code analysis
it_it: Analisi del codice

source: Code modification
it_it: Modifica del codice

source: Collateral Documents and Tools
it_it: Documenti e Strumenti Collaterali

source: Color: Selects the color used for the graphical view.
it_it: Color: Seleziona il colore utilizzato per la vista grafica.

source: Comments
it_it: Commenti

source: Comments always start with // (like in C++).
it_it: I commenti iniziano sempre con // (come in C++).

source: Communication interface
it_it: Interfaccia di comunicazione

source: Commutation: All commutation modes supported by the module are shown here.
it_it: Commutation: Qui vengono visualizzate tutte le modalità di commutazione supportate dal modulo.

source: Compile and Flash Demos
it_it: Compilazione e Flash dei Demo

source: Compile and upload the program:
it_it: Compilare e caricare il programma:

source: Compile, Flash and Serial Port Monitor
it_it: Compilazione, Flash e Monitor della Porta Seriale

source: Component reference: The import of libraries in the Python development environment only requires to "import library name or path", while ESP-IDF is based on the C language, and the importing of libraries is configured and defined through CMakeLists.txt.
it_it: Riferimento ai componenti: L'importazione di librerie nell'ambiente di sviluppo Python richiede solo "importare il nome o il percorso della libreria", mentre ESP-IDF si basa sul linguaggio C e l'importazione delle librerie viene configurata e definita tramite CMakeLists.txt.

source: Component: The components in ESP-IDF are the basic modules for building applications, each component is usually a relatively independent code base or library, which can implement specific functions or services, and can be reused by applications or other components, similar to the definition of libraries in Python development.
it_it: Componente: I componenti in ESP-IDF sono i moduli di base per la creazione di applicazioni. Ogni componente è solitamente una base di codice o libreria relativamente indipendente, che può implementare funzioni o servizi specifici e può essere riutilizzata da applicazioni o altri componenti, in modo simile alla definizione di librerie nello sviluppo Python.

source: Components Preparation
it_it: Preparazione dei Componenti

source: Confirm assembler success: If this option is selected then the assembler dialog will stay open after successful program assembly.
it_it: Confirm assembler success: Se questa opzione è selezionata, la finestra di dialogo dell'assembler rimarrà aperta dopo l'assemblaggio del programma.

source: Confirm assembler success: When set, the assembler dialog will stay open after successful TMCL program assembly.
it_it: Confirm assembler success: Se impostato, la finestra di dialogo dell'assembler rimarrà aperta dopo l'assemblaggio del programma TMCL.
